#+DATE: <2016-08-07 Sun>
#+EMAIL: emmanuel.gallois@gmail.com
#+LANGUAGE: en
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:t
#+OPTIONS: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t
#+OPTIONS: inline:t num:nil p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:3 todo:t |:t
#+SELECT_TAGS: exporto
#+EXCLUDE_TAGS: noexport
#+STARTUP: overview
#+PROPERTY: header-args    :results silent

#+BEGIN_QUOTE
Did you try turning it off and on again?
#+END_QUOTE

** Packages tooling bootstraping                                    :package:

   #+BEGIN_SRC emacs-lisp
     (unless (package-installed-p 'use-package)
       (package-refresh-contents)
       (package-install 'use-package))
   #+END_SRC

   And a list of packages not necessary /ensured/ by =use-package=:
   #+BEGIN_SRC emacs-lisp
     (defvar my/install-packages
       '(
         goto-last-change
         ;; searching - install platinum searcher (pt)
         exec-path-from-shell vlf bug-hunter
         org-plus-contrib
         org-attach-screenshot htmlize org-bullets
         ox-textile ox-gfm ox-twbs
         ob-lua ob-go
         gnuplot
         go-mode lua-mode
         robe rubocop ruby-refactor
         textile-mode yaml-mode
         ))
     (defvar packages-refreshed? nil)
     (dolist (pack my/install-packages)
       (unless (package-installed-p pack)
         (unless packages-refreshed?
           (package-refresh-contents)
           (setq packages-refreshed? t))
         (unwind-protect
             (condition-case ex
                 (package-install pack)
               ('error (message "Failed to install package [%s], caught exception: [%s]"
                                pack ex)))
           (message "Installed %s" pack))))
     (setq use-package-verbose t)
     (let ((elapsed (float-time (time-subtract (current-time) emacs-start-time))))
       (message "Loaded packages... %.3fs since startup" elapsed))
   #+END_SRC

   #+RESULTS:
   : Loaded packages... 62.292s since startup

**** Helm
     :PROPERTIES:
     :header-args: :tangle yes
     :END:

     #+BEGIN_SRC emacs-lisp :results silent
       (use-package helm
         :ensure t
         :config
         (setq
          helm-M-x-fuzzy-match                   t ; optional fuzzy matching for helm-M-x
          helm-adaptive-history-file             "~/.emacs.d/local/helm-history"
          helm-buffers-fuzzy-matching            t ; fuzzy matching buffer names when non--nil
          helm-ff-auto-update-initial-value      t ;
          helm-ff-file-name-history-use-recentf  t
          helm-ff-search-library-in-sexp         t ; search for library in `require' and `declare-function' sexp.
          helm-ff-transformer-show-only-basename nil ;
          helm-imenu-fuzzy-match                 t ;
          helm-move-to-line-cycle-in-source      nil ; move to end or beginning of source when reaching top or bottom of source.
          helm-quick-update                      t ; do not display invisible candidates
          helm-recentf-fuzzy-match               t
          helm-scroll-amount                     8 ; scroll 8 lines other window using M-<next>/M-<prior>
          helm-split-window-in-side-p            t ; open helm buffer inside current window, not occupy whole other window
          )
         (helm-mode 1)
         (require 'helm-config)
         (autoload 'helm-descbinds      "helm-descbinds" t)
         (autoload 'helm-eshell-history "helm-eshell"    t)
         (global-set-key (kbd "C-c h")   'helm-command-prefix)
         (global-set-key (kbd "C-c i")   'helm-imenu)
         (global-set-key (kbd "C-c I")   'helm-imenu-in-all-buffers)
         (global-set-key (kbd "C-h a")   'helm-apropos)
         (global-set-key (kbd "C-h b")   'helm-descbinds)
         (global-set-key (kbd "C-h i")   'helm-info-emacs)
         (global-set-key (kbd "C-x C-b") 'helm-buffers-list)
         (global-set-key (kbd "C-x C-f") 'helm-find-files)
         (global-set-key (kbd "C-x C-r") 'helm-recentf)
         (global-set-key (kbd "C-x b")   'helm-mini)
         (global-set-key (kbd "C-x r l") 'helm-filtered-bookmarks)
         (global-set-key (kbd "M-s /")   'helm-multi-swoop)
         (global-set-key (kbd "M-s o")   'helm-swoop)
         (global-set-key (kbd "M-x")     'helm-M-x)
         (global-set-key (kbd "M-y")     'helm-show-kill-ring)
          :diminish ""
         )
       (when (executable-find "curl")
         (setq helm-google-suggest-use-curl-p t))
       ;;(with-eval-after-load 'helm (helm-adaptive))
       ;;(helm-adaptative-mode 1)
     #+END_SRC
    swoop is really cool
    #+BEGIN_SRC emacs-lisp :results silent
      (use-package helm-descbinds :ensure t)
      (use-package helm-swoop :ensure t)
      (setq helm-follow-mode-persistent t)
      (use-package helm-ag
        :ensure t
        :config
        (setq
         helm-ag-base-command "pt -e --nocolor --nogroup")
        )
    #+END_SRC

    dash

    : m-x helm-dash-install-docset
    : m-x helm-dash-install-user-docset
    : m-x helm-dash-at-point RET
    #+BEGIN_SRC emacs-lisp
      (use-package helm-dash
        :ensure t
        :config
        (setq
         helm-dash-docsets-path     (concat my/local-dir "docsets")
         helm-dash-browser-func     'eww
         helm-dash-enable-debugging t
         helm-dash-min-length       2
         helm-dash-common-docsets   '("Emacs Lisp" "Org_Mode")
         ))
      (unless (file-exists-p helm-dash-docsets-path)
        (mkdir helm-dash-docsets-path))
    #+END_SRC

    #+RESULTS:

    To set buffer local docset :
    #+BEGIN_SRC emacs-lisp
      (defun dash-hook ()
        (local-set-key (kbd "C-h d d") 'helm-dash)
        (local-set-key (kbd "C-h d a") 'helm-dash-at-point)
        (local-set-key (kbd "C-h d r") 'helm-dash-reset-connections)
        )
      (defun dash-hook-go () (interactive) (setq-local helm-dash-docsets '("Go")))
      (defun dash-hook-org () (interactive) (setq-local helm-dash-docsets '("Org_Mode" "Emacs Lisp")))
      (defun dash-hook-ruby () (interactive) (setq-local helm-dash-docsets '("Ruby")))
      (defun dash-hook-perl () (interactive) (setq-local helm-dash-docsets '("Perl")))
      (defun dash-hook-lua () (interactive) (setq-local helm-dash-docsets '("Lua")))
      (defun dash-hook-clojure () (interactive) (setq-local helm-dash-docsets '("Clojure")))
      (add-hook 'prog-mode-hook 'dash-hook)
      (add-hook 'org-mode-hook  'dash-hook)
      (add-hook 'org-mode-hook  'dash-hook-org)
      (add-hook 'go-mode-hook   'dash-hook-go)
      (add-hook 'ruby-mode-hook 'dash-hook-ruby)
      (add-hook 'perl-mode-hook 'dash-hook-perl)
      (add-hook 'lua-mode-hook  'dash-hook-lua)
      (add-hook 'clojure-mode-hook  'dash-hook-clojure)
    #+END_SRC

    #+RESULTS:
    | dash-hook-lua |

*** Clocking
    :LOGBOOK:
    CLOCK: [2016-10-05 mer. 17:24]--[2016-10-05 mer. 17:25] =>  0:01
    :END:

    #+BEGIN_SRC emacs-lisp
    (org-clock-persistence-insinuate); Set up hooks for clock persistence.
    #+END_SRC

**** Managed languages :
    #+BEGIN_SRC emacs-lisp :results silent
    (setq org-confirm-babel-evaluate nil)
    (org-babel-do-load-languages
     'org-babel-load-languages
     '(
       (C . t)
       (awk . t)
       (calc . t)
       (clojure . t)
       (ditaa . t)
       (dot . t)
       (emacs-lisp . t)
       (go . t)
       (js . t)
       (latex . t)
       (ledger . t)
       (lisp . t)
       (makefile . t)
       (perl . t)
       (plantuml . t)
       (python . t)
       (ruby . t)
       (scala . t)
       (scheme . t)
       (sh . t)
       (sql . t)
       ;; (racket . t)
       ;; (scribble . t)
       ))
    ;; additional tools setup
    (setq org-ditaa-jar-path "/usr/local/Cellar/ditaa/0.9/libexec/ditaa0_9.jar")
    (setq plantuml-jar-path (expand-file-name "~/bin/plantuml.jar"))
    (setq org-plantuml-jar-path plantuml-jar-path)
    #+END_SRC

    #+RESULTS:
    : /home/undx/bin/plantuml.jar

